// Задача 3. 
//Написать программу, которая принимает число и выдает, является ли оно четным. 

string s_a = Console.ReadLine()!;

int a = int.Parse(s_a);

if(a%2==0) Console.WriteLine("Yes");
else Console.WriteLine("No");

